app/controllers/products_controller.rb

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
UPDATE "products" SET "description" = 'well well', "updated_at" = '2011-03-26 21:49:40.819409' WHERE "products"."id" = 1